app/Controllers/CaisseController.php

    public function selectCaisse()
    {
        $session  = session();
        if (!$session->get('utilisateur')) {
            return redirect()->to('/login');
        }

        $idCaisse = (int) $this->request->getPost('id_caisse');

        if ($idCaisse <= 0) {
            return redirect()->to('/')->with('error', 'Veuillez selectionner une caisse.');
        }

        $model  = new CaisseModel();
        $caisse = $model->find($idCaisse);
---
SELECT *
FROM `caisse`
WHERE `caisse`.`id_caisse` = 2