app/Models/AchatModel.php

    public function getAchatsByCaisse(int $idCaisse): array
    {
        return $this->db->table('achat a')
            ->select('a.id_achat, p.designation, p.prix, a.quantite, (p.prix * a.quantite) AS total, a.date_achat')
            ->join('produit p', 'p.id_produit = a.id_produit')
            ->where('a.id_caisse', $idCaisse)
            ->where('a.cloture', 0)
            ->orderBy('a.date_achat', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT `a`.`id_achat`, `p`.`designation`, `p`.`prix`, `a`.`quantite`, (p.prix * a.quantite) AS total, `a`.`date_achat`
FROM `achat` `a`
JOIN `produit` `p` ON `p`.`id_produit` = `a`.`id_produit`
WHERE `a`.`id_caisse` = 1
AND `a`.`cloture` = 0
ORDER BY `a`.`date_achat` DESC