app/Models/CaisseModel.php

SELECT *
FROM `caisse`
---
    public function getAllCaisses(): array
    {
        return $this->findAll();