app/Models/ProduitModel.php

SELECT *
FROM `produit`
---
    public function getAllProduits(): array
    {
        return $this->findAll();