app/Models/UtilisateurModel.php

SELECT *
FROM `utilisateur`
WHERE `nom_utilisateur` = 'caissier1'
AND `mot_de_passe` = '1234'
 LIMIT 1
---
    public function authenticate(string $username, string $password): ?array
    {
        return $this->where('nom_utilisateur', $username)
                    ->where('mot_de_passe', $password)
                    ->first();